redis_benchmark/test/withoutKubearmor10_10000.txt
====== GET ======
  10000 requests completed in 0.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 6746)
75.000% <= 0.311 milliseconds (cumulative count 8184)
87.500% <= 0.319 milliseconds (cumulative count 8757)
93.750% <= 0.351 milliseconds (cumulative count 9453)
96.875% <= 0.383 milliseconds (cumulative count 9690)
98.438% <= 0.447 milliseconds (cumulative count 9846)
99.219% <= 0.903 milliseconds (cumulative count 9923)
99.609% <= 1.047 milliseconds (cumulative count 9962)
99.805% <= 1.191 milliseconds (cumulative count 9993)
99.951% <= 1.199 milliseconds (cumulative count 9999)
99.994% <= 1.207 milliseconds (cumulative count 10000)
100.000% <= 1.207 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.130% <= 0.207 milliseconds (cumulative count 13)
67.460% <= 0.303 milliseconds (cumulative count 6746)
97.800% <= 0.407 milliseconds (cumulative count 9780)
98.760% <= 0.503 milliseconds (cumulative count 9876)
99.010% <= 0.607 milliseconds (cumulative count 9901)
99.020% <= 0.807 milliseconds (cumulative count 9902)
99.230% <= 0.903 milliseconds (cumulative count 9923)
99.500% <= 1.007 milliseconds (cumulative count 9950)
99.670% <= 1.103 milliseconds (cumulative count 9967)
100.000% <= 1.207 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 84745.77 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.310     0.112     0.303     0.359     0.543     1.207