redis_benchmark/test/withoutKubearmor4_10000.txt
====== GET ======
  10000 requests completed in 0.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.119 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 5908)
75.000% <= 0.343 milliseconds (cumulative count 7662)
87.500% <= 0.407 milliseconds (cumulative count 8768)
93.750% <= 0.431 milliseconds (cumulative count 9515)
96.875% <= 0.447 milliseconds (cumulative count 9785)
98.438% <= 0.455 milliseconds (cumulative count 9850)
99.219% <= 0.503 milliseconds (cumulative count 9927)
99.609% <= 0.847 milliseconds (cumulative count 9961)
99.805% <= 0.951 milliseconds (cumulative count 9984)
99.902% <= 0.975 milliseconds (cumulative count 9991)
99.951% <= 0.991 milliseconds (cumulative count 9996)
99.976% <= 0.999 milliseconds (cumulative count 10000)
100.000% <= 0.999 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.150% <= 0.207 milliseconds (cumulative count 15)
59.080% <= 0.303 milliseconds (cumulative count 5908)
87.680% <= 0.407 milliseconds (cumulative count 8768)
99.270% <= 0.503 milliseconds (cumulative count 9927)
99.440% <= 0.607 milliseconds (cumulative count 9944)
99.480% <= 0.703 milliseconds (cumulative count 9948)
99.550% <= 0.807 milliseconds (cumulative count 9955)
99.710% <= 0.903 milliseconds (cumulative count 9971)
100.000% <= 1.007 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 79365.08 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.325     0.112     0.303     0.431     0.479     0.999