redis_benchmark/test/withoutKubearmor5_10000.txt
====== GET ======
  10000 requests completed in 0.12 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 1)
50.000% <= 0.303 milliseconds (cumulative count 6530)
75.000% <= 0.311 milliseconds (cumulative count 7548)
87.500% <= 0.343 milliseconds (cumulative count 8928)
93.750% <= 0.375 milliseconds (cumulative count 9394)
96.875% <= 0.415 milliseconds (cumulative count 9719)
98.438% <= 0.471 milliseconds (cumulative count 9846)
99.219% <= 0.655 milliseconds (cumulative count 9930)
99.609% <= 1.167 milliseconds (cumulative count 9961)
99.805% <= 1.295 milliseconds (cumulative count 9981)
99.902% <= 1.343 milliseconds (cumulative count 9991)
99.951% <= 1.383 milliseconds (cumulative count 9997)
99.976% <= 1.399 milliseconds (cumulative count 9998)
99.988% <= 1.415 milliseconds (cumulative count 9999)
99.994% <= 1.431 milliseconds (cumulative count 10000)
100.000% <= 1.431 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.170% <= 0.207 milliseconds (cumulative count 17)
65.300% <= 0.303 milliseconds (cumulative count 6530)
96.860% <= 0.407 milliseconds (cumulative count 9686)
98.650% <= 0.503 milliseconds (cumulative count 9865)
99.000% <= 0.607 milliseconds (cumulative count 9900)
99.460% <= 0.703 milliseconds (cumulative count 9946)
99.500% <= 0.807 milliseconds (cumulative count 9950)
99.550% <= 1.103 milliseconds (cumulative count 9955)
99.670% <= 1.207 milliseconds (cumulative count 9967)
99.830% <= 1.303 milliseconds (cumulative count 9983)
99.980% <= 1.407 milliseconds (cumulative count 9998)
100.000% <= 1.503 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 83333.34 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.313     0.104     0.303     0.391     0.607     1.431