redis_benchmark/test/withoutKubearmor6_10000.txt
====== GET ======
  10000 requests completed in 0.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.103 milliseconds (cumulative count 1)
50.000% <= 0.343 milliseconds (cumulative count 5026)
75.000% <= 0.415 milliseconds (cumulative count 7791)
87.500% <= 0.431 milliseconds (cumulative count 9188)
93.750% <= 0.439 milliseconds (cumulative count 9432)
96.875% <= 0.463 milliseconds (cumulative count 9696)
98.438% <= 0.543 milliseconds (cumulative count 9849)
99.219% <= 0.639 milliseconds (cumulative count 9926)
99.609% <= 1.103 milliseconds (cumulative count 9961)
99.805% <= 1.271 milliseconds (cumulative count 9981)
99.902% <= 1.335 milliseconds (cumulative count 9991)
99.951% <= 1.367 milliseconds (cumulative count 9996)
99.976% <= 1.391 milliseconds (cumulative count 9999)
99.994% <= 1.399 milliseconds (cumulative count 10000)
100.000% <= 1.399 milliseconds (cumulative count 10000)

Cumulative distribution of latencies:
0.010% <= 0.103 milliseconds (cumulative count 1)
0.160% <= 0.207 milliseconds (cumulative count 16)
36.520% <= 0.303 milliseconds (cumulative count 3652)
68.100% <= 0.407 milliseconds (cumulative count 6810)
97.830% <= 0.503 milliseconds (cumulative count 9783)
99.110% <= 0.607 milliseconds (cumulative count 9911)
99.500% <= 0.703 milliseconds (cumulative count 9950)
99.530% <= 1.007 milliseconds (cumulative count 9953)
99.610% <= 1.103 milliseconds (cumulative count 9961)
99.730% <= 1.207 milliseconds (cumulative count 9973)
99.850% <= 1.303 milliseconds (cumulative count 9985)
100.000% <= 1.407 milliseconds (cumulative count 10000)

Summary:
  throughput summary: 70921.98 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.363     0.096     0.343     0.447     0.599     1.399